In [1]:
import pandas as pd
import numpy as np

In [3]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with DATES

In [8]:
date['date'] = pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## 1. Extract year

In [10]:
date['date_year'] = date['date'].dt.year

date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## 2. Extract month

In [11]:
date['date_month'] = date['date'].dt.month
date.head()

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8
2 2018-10-23        1859       25       1       2018          10
3 2019-08-17        7292       25       1       2019           8
4 2019-01-06        4344       25       3       2019           1

In [12]:
date['date_month_name'] = date['date'].dt.month_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

## 3. Extract Day

In [13]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [14]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [ ]:
# date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

## Extract Time elapsed between dates

In [18]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 3, 9, 17, 13, 47, 98923)

In [19]:
today - date['date']

0     1551 days 17:13:47.098923
1     2033 days 17:13:47.098923
2     1964 days 17:13:47.098923
3     1666 days 17:13:47.098923
4     1889 days 17:13:47.098923
                 ...
995   1979 days 17:13:47.098923
996   1920 days 17:13:47.098923
997   1768 days 17:13:47.098923
998   1833 days 17:13:47.098923
999   1607 days 17:13:47.098923
Name: date, Length: 1000, dtype: timedelta64[ns]

In [20]:
(today - date['date']).dt.days

0      1551
1      2033
2      1964
3      1666
4      1889
       ...
995    1979
996    1920
997    1768
998    1833
999    1607
Name: date, Length: 1000, dtype: int64

In [21]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      50.0
1      66.0
2      63.0
3      54.0
4      61.0
       ...
995    64.0
996    62.0
997    57.0
998    59.0
999    52.0
Name: date, Length: 1000, dtype: float64

In [22]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [23]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [24]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [25]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [26]:
today - time['date']

0     3737 days 16:23:47.098923
1     3601 days 17:33:47.098923
2     4087 days 16:52:47.098923
3     3389 days 16:42:47.098923
4     3786 days 18:02:47.098923
                 ...
995   4376 days 16:23:47.098923
996   3697 days 17:59:47.098923
997   4162 days 17:36:47.098923
998   4278 days 17:39:47.098923
999   3550 days 17:48:47.098923
Name: date, Length: 1000, dtype: timedelta64[ns]

In [27]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.229358e+08
1      3.111896e+08
2      3.531776e+08
3      2.928698e+08
4      3.271754e+08
           ...
995    3.781454e+08
996    3.194856e+08
997    3.596602e+08
998    3.696828e+08
999    3.067841e+08
Name: date, Length: 1000, dtype: float64

In [28]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.382264e+06
1      5.186494e+06
2      5.886293e+06
3      4.881163e+06
4      5.452923e+06
           ...
995    6.302424e+06
996    5.324760e+06
997    5.994337e+06
998    6.161380e+06
999    5.113069e+06
Name: date, Length: 1000, dtype: float64

In [29]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       89704.396416
1       86441.563083
2       98104.879750
3       81352.713083
4       90882.046416
           ...
995    105040.396416
996     88745.996416
997     99905.613083
998    102689.663083
999     85217.813083
Name: date, Length: 1000, dtype: float64